In [33]:
import sqlite3
from sqlite3 import Error

In [24]:

hello=("SELECT name AS 'Facility Name:', SUM(CASE WHEN memid =0 THEN guestcost * slots ELSE membercost * slots END ) AS Revenue FROM Bookings AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY name HAVING Revenue < 1000.0")

In [16]:
with open(r'C:\Users\Mamer Jammer\Desktop\sql\SQLFiles Tier 1\LocalSQLConnection.py')as con:
    con=sqlite3.connect('sqlite_db_pythonsqlite.db')

In [17]:
cur=con.cursor()

In [23]:
hello=cur.execute(hello)
for row in hello:
    orint (row)

ValueError: operation parameter must be str

In [19]:
import pandas as pd

# A1

In [27]:
query1=("select name FROM Facilities WHERE membercost > 0.0")
a1=pd.read_sql_query(query1,con)

In [28]:
a1

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

# A2

In [29]:
query2=("SELECT count(*) FROM `Facilities` WHERE membercost=0.0")
a2=pd.read_sql_query(query2,con)
a2

   count(*)
0         4

# A3

In [31]:
query3=("SELECT facid, membercost, monthlymaintenance, name FROM Facilities WHERE membercost < ( monthlymaintenance * 0.20 )")
a3=pd.read_sql_query(query3,con)
a3

   facid  membercost  monthlymaintenance             name
0      0         5.0                 200   Tennis Court 1
1      1         5.0                 200   Tennis Court 2
2      2         0.0                  50  Badminton Court
3      3         0.0                  10     Table Tennis
4      4         9.9                3000   Massage Room 1
5      5         9.9                3000   Massage Room 2
6      6         3.5                  80     Squash Court
7      7         0.0                  15    Snooker Table
8      8         0.0                  15       Pool Table

# A4

In [35]:
query4=("SELECT * FROM Facilities WHERE facid IN ( 1, 5 )")
a4=pd.read_sql_query(query4,con)
a4

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25,8000,200
1,5,Massage Room 2,9.9,80,4000,3000

# A5

In [37]:
query5=("SELECT name AS 'Facility Name:',CASE WHEN monthlymaintenance > 100.0 THEN 'Expensive' ELSE 'cheap' END AS 'Expensive/Cheap' FROM Facilities")
a5=pd.read_sql_query(query5,con)
a5

    Facility Name: Expensive/Cheap
0   Tennis Court 1       Expensive
1   Tennis Court 2       Expensive
2  Badminton Court           cheap
3     Table Tennis           cheap
4   Massage Room 1       Expensive
5   Massage Room 2       Expensive
6     Squash Court           cheap
7    Snooker Table           cheap
8       Pool Table           cheap

# A6

In [38]:
query6=("SELECT CONCAT( firstname, ' ', surname ) AS 'Member Name', joindate FROM Members WHERE joindate = ( SELECT MAX( joindate ) FROM Members )")
a6=pd.read_sql_query(query6,con)
a6

DatabaseError: Execution failed on sql 'SELECT CONCAT( firstname, ' ', surname ) AS 'Member Name', joindate FROM Members WHERE joindate = ( SELECT MAX( joindate ) FROM Members )': no such function: CONCAT

# A7

In [39]:
query7=("SELECT DISTINCT CONCAT( m.firstname, ' ', m.surname ) AS 'Member Name', f.name FROM Members AS m INNER JOIN Bookings AS b ON m.memid = b.memid INNER JOIN Facilities AS f ON f.facid = b.facid WHERE b.facid IN ( 0, 1 ) ORDER BY firstname ASC")
a7=pd.read_sql_query(query7,con)
a7

DatabaseError: Execution failed on sql 'SELECT DISTINCT CONCAT( m.firstname, ' ', m.surname ) AS 'Member Name', f.name FROM Members AS m INNER JOIN Bookings AS b ON m.memid = b.memid INNER JOIN Facilities AS f ON f.facid = b.facid WHERE b.facid IN ( 0, 1 ) ORDER BY firstname ASC': no such function: CONCAT

# A8

In [ ]:
SELECT CONCAT( m.firstname, " ", m.surname ) AS name, f.name AS facility_name,
CASE WHEN firstname = 'GUEST'
THEN guestcost * slots
ELSE membercost * slots
END AS cost, starttime
FROM Bookings AS b
JOIN Members AS m ON b.memid = m.memid
JOIN Facilities f ON b.facid = f.facid
WHERE starttime LIKE '%2012-09-14%'
AND
CASE WHEN firstname = 'GUEST'
THEN guestcost * slots
ELSE membercost * slots
END >30

# A9

In [ ]:
SELECT CONCAT( m.firstname, " ", m.surname ) AS name, f.name AS facility_name,
CASE WHEN firstname = 'GUEST'
THEN guestcost * slots
ELSE membercost * slots
END AS cost, starttime
FROM Bookings AS b
JOIN Members AS m ON b.memid = m.memid
JOIN Facilities f ON b.facid = f.facid
WHERE starttime LIKE '%2012-09-14%'
AND
CASE WHEN firstname = 'GUEST'
THEN guestcost * slots
ELSE membercost * slots
END >30

# A10

In [42]:
query10=("SELECT name AS 'Facility Name:', SUM(CASE WHEN memid =0 THEN guestcost * slots ELSE membercost * slots END ) AS Revenue FROM Bookings AS b LEFT JOIN Facilities AS f ON b.facid = f.facid GROUP BY name HAVING Revenue < 1000.0")
a10=pd.read_sql_query(query10,con)
a10

  Facility Name:  Revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

# A11

In [55]:
query11=("SELECT ( m.surname + '  '+ m.firstname)  AS 'Member Names:', (m2.firstname + ' ' + m2.surname) as 'Recommended by:' FROM Members as m INNER JOIN Members as m2 on m.recommendedby = m2.memid WHERE m.recommendedby > 0 ORDER BY m.surname ASC")
a11=pd.read_sql_query(query11,con)
a11

    Member Names:  Recommended by:
0               0                0
1               0                0
2               0                0
3               0                0
4               0                0
5               0                0
6               0                0
7               0                0
8               0                0
9               0                0
10              0                0
11              0                0
12              0                0
13              0                0
14              0                0
15              0                0
16              0                0
17              0                0
18              0                0
19              0                0
20              0                0
21              0                0

# A12

In [59]:
query12=("SELECT f.name AS 'Facility Name:', SUM( b.slots ) AS 'Total bookings:' FROM Bookings AS b INNER JOIN Facilities AS f ON f.facid = b.facid WHERE memid >0 GROUP BY b.facid ORDER BY SUM( b.slots ) DESC")
a12=pd.read_sql_query(query12,con)
a12

    Facility Name:  Total bookings:
0  Badminton Court             1086
1   Tennis Court 1              957
2   Massage Room 1              884
3   Tennis Court 2              882
4    Snooker Table              860
5       Pool Table              856
6     Table Tennis              794
7     Squash Court              418
8   Massage Room 2               54

# A13

In [ ]:
query13=("SELECT f.name AS 'Facility Name:',SUM(CASE WHEN EXTRACT(MONTH FROM starttime ) =7 THEN 1 ELSE 0 END) AS July,SUM(CASE WHEN EXTRACT(MONTH FROM starttime )=8 THEN 1 ELSE 0 END) AS August, SUM(CASE WHEN EXTRACT(MONTH FROM starttime )=9 THEN 1 ELSE 0 END) AS September FROM Bookings AS b INNER JOIN Facilities AS f ON f.facid = b.facid WHERE memid >0 GROUP BY name")
a13=pd.read_sql_query(query13,con)
a13